app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // Get today's statistics
        $todayStats = $this->inventoryModel
            ->select('
                users.name as employee_name,
                COUNT(inventory.id) as total_entries,
                SUM(inventory.received_quantity) as total_quantity,
                SUM(inventory.cost) as total_cost
            ')
            ->join('users', 'users.id = inventory.employee_id')
            ->where('DATE(inventory.created_at)', date('Y-m-d'))
            ->groupBy('inventory.employee_id')
            ->find();

        // Get current month statistics
        $monthStats = $this->inventoryModel
            ->select('
                users.name as employee_name,
                COUNT(inventory.id) as total_entries,
                SUM(inventory.received_quantity) as total_quantity,
                SUM(inventory.cost) as total_cost
            ')
            ->join('users', 'users.id = inventory.employee_id')
            ->where('MONTH(inventory.created_at)', date('m'))
            ->where('YEAR(inventory.created_at)', date('Y'))
            ->groupBy('inventory.employee_id')
            ->find();

        $data = [
            'title' => 'Dashboard',
            'total_products' => $this->productModel->countAll(),
            'total_users' => $this->userModel->countAll(),
---
SELECT `users`.`name` as `employee_name`, COUNT(inventory.id) as total_entries, SUM(inventory.received_quantity) as total_quantity, SUM(inventory.cost) as total_cost
FROM `inventory`
JOIN `users` ON `users`.`id` = `inventory`.`employee_id`
WHERE DATE(inventory.created_at) = '2024-12-18'
GROUP BY `inventory`.`employee_id`
SELECT `users`.`name` as `employee_name`, COUNT(inventory.id) as total_entries, SUM(inventory.received_quantity) as total_quantity, SUM(inventory.cost) as total_cost
FROM `inventory`
JOIN `users` ON `users`.`id` = `inventory`.`employee_id`
WHERE MONTH(inventory.created_at) = '12'
AND YEAR(inventory.created_at) = '2024'
GROUP BY `inventory`.`employee_id`
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `users`