app/Controllers/Admin/Products.php

SELECT *
FROM `products`
ORDER BY `name` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        $perPage = $this->request->getGet('per_page') ?? 10;
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort') ?? 'name';
        $order = $this->request->getGet('order') ?? 'asc';

        // Start the query
        $builder = $this->productModel;

        // Apply search if provided
        if ($search) {
            $builder->groupStart()
                    ->like('name', $search)
                    ->orLike('size', $search)
                    ->groupEnd();
        }

        // Apply sorting
        $allowedSort = ['name', 'size', 'price'];
        if (in_array($sort, $allowedSort)) {
            $builder->orderBy($sort, $order === 'asc' ? 'asc' : 'desc');
        }

        $data = [
            'title' => 'Products Management',
            'products' => $builder->paginate($perPage),

SELECT *
FROM `products`
WHERE `products`.`id` = '95'
---
    public function edit($id)
    {
        if ($this->request->isAJAX()) {
            $product = $this->productModel->find($id);

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function getProducts()
    {
        if (!$this->request->isAJAX()) {
            return redirect()->to('admin/products');
        }

        // Convert string values to integers
        $draw = (int) $this->request->getPost('draw');
        $start = (int) $this->request->getPost('start');
        $length = (int) $this->request->getPost('length');
        $search = $this->request->getPost('search')['value'];
        $order = $this->request->getPost('order')[0];

        $columns = ['name', 'size', 'price'];
        $orderColumn = $columns[$order['column']];
        $orderDir = $order['dir'];

        // Get total count
        $total = $this->productModel->countAll();