app/Controllers/Admin/Users.php

SELECT *
FROM `users`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $perPage = $this->request->getGet('per_page') ?? 10;
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort') ?? 'id';
        $order = $this->request->getGet('order') ?? 'asc';

        // Start the query
        $builder = $this->userModel;

        // Apply search if provided
        if ($search) {
            $builder->groupStart()
                    ->like('name', $search)
                    ->orLike('phone', $search)
                    ->orLike('role', $search)
                    ->groupEnd();
        }

        // Apply sorting
        $allowedSort = ['id', 'name', 'phone', 'role'];
        if (in_array($sort, $allowedSort)) {
            $builder->orderBy($sort, $order === 'asc' ? 'asc' : 'desc');
        }

        $data = [
            'title' => 'Users Management',
            'users' => $builder->paginate($perPage),

SELECT *
FROM `users`
WHERE `users`.`id` = '15'
---
    public function edit($id)
    {
        if ($this->request->isAJAX()) {
            $user = $this->userModel->find($id);

INSERT INTO `users` (`name`, `phone`, `role`, `password`, `created_at`, `updated_at`) VALUES ('ravi shanker', '9644400087', 'Admin', '$2y$10$AlMINbnv.nuO7K8B2W0Fje4juyvsgpZgQVY.7C45UXyq7tSLpiOxO', '2024-12-18 05:27:45', '2024-12-18 05:27:45')
---
            if ($id) {
                $result = $this->userModel->update($id, $data);
            } else {
                $result = $this->userModel->insert($data);

SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function getUsers()
    {
        if (!$this->request->isAJAX()) {
            return redirect()->to('admin/users');
        }

        // Convert string values to integers
        $draw = (int) $this->request->getPost('draw');
        $start = (int) $this->request->getPost('start');
        $length = (int) $this->request->getPost('length');
        $search = $this->request->getPost('search')['value'];
        $order = $this->request->getPost('order')[0];

        $columns = ['name', 'phone', 'role'];
        $orderColumn = $columns[$order['column']];
        $orderDir = $order['dir'];

        // Get total count
        $total = $this->userModel->countAll();