app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `phone` = '9644400087'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $phone = $this->request->getPost('phone');
            $password = $this->request->getPost('password');

            $user = $this->userModel->where('phone', $phone)->first();